# RebarShapeParamEndHookTanLen Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarShapeParamEndHookTanLen Property
ParameterTypeId Class See Also
---
"End Tangent Hook Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarShapeParamEndHookTanLen { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarShapeParamEndHookTanLen As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarShapeParamEndHookTanLen {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace